// :: pages/test/ctest_index1
import { Api_product_add_ctn } from "@xyfs/taro_uii/api/api__product";
import { ComButton } from "@xyfs/taro_uii/components/ComButton";
import { ComNav } from "@xyfs/taro_uii/components/ComNav";
import { ComNavBarA } from "@xyfs/taro_uii/components/ComNavBarA";
import { ComScrollView } from "@xyfs/taro_uii/components/ComScrollView";
import { ComSELFView, MMMAAPage } from "@xyfs/taro_uii/components/MMMAAPage";
import { FC } from "react";

definePageConfig({
  navigationStyle: "custom", enableShareAppMessage: true, disableScroll: true,
  // "styleIsolation": "apply-shared",
  // "componentFramework": "glass-easel",
  // "renderer": "skyline",

});


const arr = [
  "1,布鞋_网鞋,纯黑_深色,清洗,8.8",
  "1,布鞋_网鞋,纯黑_深色_白边,清洗,12.8",
  "1,布鞋_网鞋,纯白_浅色_拼色,清洗,15",
  "1,皮鞋,,清洗,15",
  "1,磨砂鞋,,清洗,19.8",
  "1,靴子,布面_短_,清洗,16.8",
  "1,靴子,布面_中_,清洗,19.8",
  "1,靴子,布面_高_,清洗,25",
  "1,靴子,皮面_短_,清洗,16.8",
  "1,靴子,皮面_中_,清洗,19.8",
  "1,靴子,皮面_高_,清洗,25",
  "1,靴子,磨砂面_短_,清洗,22.8",
  "1,靴子,磨砂面_中_,清洗,26.8",
  "1,靴子,磨砂面_高_,清洗,29.8",
  "1,高跟鞋,皮面,清洗,16.8",
  "1,高跟鞋,磨砂面,清洗,19.8",
  "1,凉鞋,布,清洗,12.8",
  "1,凉鞋,皮面,清洗,12.8",
  "1,凉鞋,磨砂面,清洗,16.8",
  "2,背心,普通,清洗,12.8",
  "2,背心,羊毛,清洗,16.8",
  "2,短袖_衬衣短袖_马甲,普通,清洗,13.8",
  "2,短袖_衬衣短袖_马甲,羊毛_亚麻_真丝,清洗,16.8",
  "2,衬衣长袖,普通,清洗,15",
  "2,衬衣长袖,羊毛_亚麻_真丝,清洗,18",
  "2,T恤_卫衣_,普通,清洗,15",
  "2,T恤_卫衣_,厚_加绒,清洗,18",
  "2,T恤_卫衣_,真丝_亚麻_羊毛_羊毛衫_,清洗,19.8",
  "2,西装外套,普通,清洗,19.8",
  "2,西装外套,羊毛_亚麻_真丝,清洗,26.8",
  "2,风衣,中,清洗,25",
  "2,风衣,长,清洗,29.8",
  "2,羽绒服皮草,A,清洗,88",
  "2,羽绒服皮草,B,清洗,108",
  "2,羽绒服皮草,C,清洗,128",
  "2,羽绒马甲_儿童羽绒服,,清洗,18",
  "2,外套,休闲_牛仔_运动,清洗,19.8",
  "2,外套,加厚_加绒,清洗,25",
  "2,外套,亚麻_羊毛_真丝_小香风,清洗,26.8",
  "2,棉服_毛呢_羽绒服,短,清洗,24.8",
  "2,棉服_毛呢_羽绒服,中,清洗,29.8",
  "2,棉服_毛呢_羽绒服,长,清洗,35",
  "2,毛呢羽绒服,,清洗,35",
  "2,内胆,聚酯纤维等,清洗,19.9",
  "2,内胆,羽绒,清洗,29",
  "2,内胆,皮草,清洗,99",
  "2,皮草,聚酯纤维等,清洗保养,88",
  "2,皮草,真皮,清洗保养,168",
  "3,秋裤,普通,清洗,15",
  "3,秋裤,羊毛,清洗,19.8",
  "3,短裤,羊毛_亚麻_真丝,清洗,19.8",
  "3,休闲裤_牛仔裤_运动裤,短,清洗,15",
  "3,休闲裤_牛仔裤_运动裤,长,清洗,18",
  "3,棉裤_羽绒裤_西裤,普通,清洗,19.8",
  "3,棉裤_羽绒裤_西裤,羊毛_真丝_亚麻(西裤),清洗,24.8",
  "3,睡衣裤子_上衣,普通,清洗,15",
  "3,睡衣裤子_上衣,羊毛_亚麻_真丝,清洗,19.8",
  "3,睡裙 ,普通,清洗,25",
  "3,睡裙 ,羊毛_真丝,清洗,35",
  "3,连衣长裙,普通,清洗,25",
  "3,连衣长裙,羊毛_亚麻_真丝,清洗,35",
  "3,半裙_短裙_,普通,清洗,15",
  "3,半裙_短裙_,羊毛_亚麻_真丝,清洗,19.8",
  "4,皮裤_皮衣,人造革_PU,清洗保养,38",
  "4,皮裤_皮衣,真皮,清洗保养,78",
  "4,皮裤_皮衣,真皮,翻新上色,188",
  "4,皮裙,人造革_PU,清洗保养,25",
  "4,皮裙,真皮,清洗保养,58",
  "4,皮裙,真皮,翻新上色,168",
  "5,书包,布艺,清洗保养,25",
  "5,书包,皮革,清洗保养,68",
  "5,手包_单肩背包_小背包_,布艺,清洗保养,28",
  "5,手包_单肩背包_小背包_,皮革,清洗保养,58",
  "5,手包_单肩背包_小背包_,皮革,翻新上色,168",
  "6,床单被罩单人,普通,清洗,38",
  "6,床单被罩单人,羊毛_亚麻_真丝,清洗,68",
  "6,床单被罩双人,普通,清洗,48",
  "6,床单被罩双人,羊毛_亚麻_真丝,清洗,88",
  "6,毛绒玩具,小,清洗,15",
  "6,毛绒玩具,中,清洗,25",
  "6,毛绒玩具,大,清洗,35",
  "6,汽车坐垫,蕾丝,清洗,68",
  "6,汽车坐垫,编制_四季垫_决明子_,清洗,88",
  "6,汽车坐垫,羊毛,清洗,99",
  "6,毛毯,单人,清洗,58",
  "6,毛毯,双人,清洗,68",
  "6,沙发座套,普通,清洗,25",
  "6,沙发座套,羊毛_亚麻_真丝,清洗,29.8",
  "6,窗帘,厚,清洗,6",
  "6,窗帘,纱,清洗,4",
  "6,地毯,普通,清洗,35",
  "6,地毯,羊毛,清洗,45",
  "7,毛领,小,清洗,10",
  "7,毛领,中,清洗,15",
  "7,毛领,大,清洗,20",
  "7,领带,,清洗,10",
  "7,围巾,普通,清洗,12.8",
  "7,围巾,羊毛_真丝,清洗,19.8",
  "7,披肩,羊毛_真丝,清洗,25",
];




export default function COMSELFWarp() { return <ComSELFView><Index></Index></ComSELFView>; };
const Index: FC = () => {
  return <MMMAAPage>
    <ComNav>
      <ComNavBarA className='mb10 pl10'>
        <ComButton ll className='bcctrans cccplh ml10'>小工具</ComButton>
      </ComNavBarA>
    </ComNav>
    <ComScrollView>
      <ComButton className='mb10' onClick={async () => {
        for (const item of arr) {
          const res = await Api_product_add_ctn({
            categoryId: Number(item.split(",")[0]!),
            intro: String(item.split(",")[2]!),
            // keywords: String(item.split(",")[3]!),
            marketPrice: String(item.split(",")[4]!),
            name: String(item.split(",")[1]!),
            pictureUrl: "https://7072-prod-5gx53h8v828f0170-1306790653.tcb.qcloud.la/product_image/oGwbL5JnohyARPysoNc-kVtUiJLY/_1714956276574_0.jpg",
            price: String(item.split(",")[4]!),
            // sketch: "",
          });
        }
      }}>
        测试上传
      </ComButton>

    </ComScrollView>
  </MMMAAPage>;
};




